spec/support/fixtures/vcr_cassettes/stripe_api/create_charge/success.yml

--- 
http_interactions: 
- request: 
    method: post
    uri: https://api.stripe.com/v1/charges
    body: 
      encoding: US-ASCII
      string: amount=1000&currency=usd&card=tok_yrkNU9PEHJWNJZ&description=alice%40example.com%20--%202012-06-08%2009%3A25%3A21
    headers: 
      Accept: 
      - "*/*; q=0.5, application/xml"
      Accept-Encoding: 
      - gzip, deflate
      User-Agent: 
      - Stripe/v1 RubyBindings/1.7.0
      Authorization: 
      - Bearer CA4fzDjIleIw9mM7gSZfCoYVgswuE2eA
      X-Stripe-Client-User-Agent: 
      - "{\"bindings_version\":\"1.7.0\",\"lang\":\"ruby\",\"lang_version\":\"1.9.3 p194 (2012-04-20)\",\"platform\":\"x86_64-darwin11.3.0\",\"publisher\":\"stripe\",\"uname\":\"Darwin Ringo-2.local 11.4.0 Darwin Kernel Version 11.4.0: Mon Apr  9 19:32:15 PDT 2012; root:xnu-1699.26.8~1/RELEASE_X86_64 x86_64 i386\"}"
      Content-Length: 
      - "113"
      Content-Type: 
      - application/x-www-form-urlencoded
  response: 
    status: 
      code: 200
      message: ...
    headers: 
      Server: 
      - nginx
      Date: 
      - Fri, 08 Jun 2012 16:25:22 GMT
      Content-Type: 
      - application/json;charset=utf-8
      Content-Length: 
      - "610"
      Connection: 
      - keep-alive
    body: 
      encoding: US-ASCII
      string: |
        {
          "amount": 1000,
          "created": 1339172721,
          "currency": "usd",
          "description": "alice@example.com -- 2012-06-08 09:25:21",
          "disputed": false,
          "fee": 0,
          "id": "ch_z2QllHZClgQA9r",
          "livemode": false,
          "object": "charge",
          "paid": true,
          "refunded": false,
          "card": {
            "country": "US",
            "cvc_check": "pass",
            "exp_month": 6,
            "exp_year": 2013,
            "fingerprint": "gDoFIK6m5B6tCyhg",
            "last4": "4242",
            "object": "card",
            "type": "Visa"
          },
          "fee_details": [
            {
              "type": "stripe_fee",
              "application": null,
              "currency": "usd",
              "amount": 0
            }
          ]
        }

    http_version: 
  recorded_at: Fri, 08 Jun 2012 16:25:22 GMT
recorded_with: VCR 2.1.1
